# The Series Data Structure

In [1]:
import pandas as pd
#pd.Series?

In [2]:
shopping_list = ['eggs', 'milk', 'flour']
pd.Series(shopping_list)

0     eggs
1     milk
2    flour
dtype: object

In [3]:
numbers = [1, 2, 3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [4]:
example = shopping_list + [None]
pd.Series(example)

0     eggs
1     milk
2    flour
3     None
dtype: object

In [5]:
numbers = [1, 2, None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [6]:
import numpy as np
np.nan == None, np.nan == np.nan, np.isnan(np.nan)

(False, False, True)

In [7]:
cities = {'Taiwan':'Taipei', 'Germany':'Berlin', 'France':'Paris'}
capitals = pd.Series(cities)
capitals.index

Index(['Taiwan', 'Germany', 'France'], dtype='object')

In [8]:
capitals = pd.Series(['Taipei', 'Berlin', 'Paris'], index = ['Taiwan', 'Germany', 'France'])
capitals

Taiwan     Taipei
Germany    Berlin
France      Paris
dtype: object

# Querying a Series

In [9]:
capitals.iloc[2], capitals.loc['France'], capitals[2] #iloc: index #loc: label

('Paris', 'Paris', 'Paris')

In [10]:
#this creates a series of random numbers
s = pd.Series(np.random.randint(0,100,500))
print(s.head(), len(s))

0    86
1    91
2    40
3    56
4    82
dtype: int32 500

In [11]:
%%timeit -n 5
sum = 0
for value in s:
    sum+= s

109 ms ± 6.06 ms per loop (mean ± std. dev. of 7 runs, 5 loops each)

In [12]:
%%timeit -n 5
sum = np.sum(s)

150 µs ± 19.4 µs per loop (mean ± std. dev. of 7 runs, 5 loops each)

In [13]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,100,500))
for label, value in s.iteritems():
    s.at[label] = value+2

4.45 ms ± 582 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [14]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,100,500))
for label, value in s.iteritems():
    s.loc[label]= value+2

93.3 ms ± 6.4 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [15]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,100,500)) 
s+=2 #adds two to each item in s using broadcasting

646 µs ± 179 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [16]:
asia = pd.Series({'Taiwan:': 'Taipei', 'Japan': 'Tokyo'})
europe = pd.Series({'Germany': 'Berlin', 'France': 'Paris'})
euroasia = asia.append(europe)
euroasia

Taiwan:    Taipei
Japan       Tokyo
Germany    Berlin
France      Paris
dtype: object

# The DataFrame Data Structure

In [17]:
purchase_1 = pd.Series({'Name':'Chris', 'Item': 'Orange juice', 'Cost': 2.49})
purchase_2 = pd.Series({'Name':'Chris', 'Item': 'Beer a six-pack', 'Cost': 3.99})
purchase_3 = pd.Series({'Name':'Jerry', 'Item': 'Egg a carton', 'Cost': 2.29})
purchase_4 = pd.Series({'Name':'Jerry', 'Item': 'Milk', 'Cost': 0.99})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3, purchase_4], index = ['Aldi', 'Aldi', 'Rewe', 'Rewe'])
df

       Name             Item  Cost
Aldi  Chris     Orange juice  2.49
Aldi  Chris  Beer a six-pack  3.99
Rewe  Jerry     Egg a carton  2.29
Rewe  Jerry             Milk  0.99

In [18]:
df.loc['Aldi']

       Name             Item  Cost
Aldi  Chris     Orange juice  2.49
Aldi  Chris  Beer a six-pack  3.99

In [19]:
df.loc['Aldi', 'Cost']

Aldi    2.49
Aldi    3.99
Name: Cost, dtype: float64

In [20]:
df.T

              Aldi             Aldi          Rewe   Rewe
Name         Chris            Chris         Jerry  Jerry
Item  Orange juice  Beer a six-pack  Egg a carton   Milk
Cost          2.49             3.99          2.29   0.99

In [21]:
df.loc['Rewe']['Cost']

Rewe    2.29
Rewe    0.99
Name: Cost, dtype: float64

In [22]:
df.loc[:, ['Name', 'Item']]

       Name             Item
Aldi  Chris     Orange juice
Aldi  Chris  Beer a six-pack
Rewe  Jerry     Egg a carton
Rewe  Jerry             Milk

In [23]:
df_2 = df.copy()
df_2 = df_2.drop('Rewe') #view only, needs assigning
df_2

       Name             Item  Cost
Aldi  Chris     Orange juice  2.49
Aldi  Chris  Beer a six-pack  3.99

In [24]:
df.drop('Name', axis = 1)

                 Item  Cost
Aldi     Orange juice  2.49
Aldi  Beer a six-pack  3.99
Rewe     Egg a carton  2.29
Rewe             Milk  0.99

In [25]:
del df['Name'] #in-place deletion
df

                 Item  Cost
Aldi     Orange juice  2.49
Aldi  Beer a six-pack  3.99
Rewe     Egg a carton  2.29
Rewe             Milk  0.99

In [26]:
df['Location'] = 'Tuebingen'

In [27]:
df

                 Item  Cost   Location
Aldi     Orange juice  2.49  Tuebingen
Aldi  Beer a six-pack  3.99  Tuebingen
Rewe     Egg a carton  2.29  Tuebingen
Rewe             Milk  0.99  Tuebingen

# Dataframe Indexing and Loading

In [28]:
df = pd.read_csv('data\olympics.csv', index_col = 0, skiprows = 1)
for col in df.columns:
    if col[:2] == '01':
        df.rename(columns={col:'Gold' + col[4:]}, inplace = True)
    elif col[:2] == '02':
        df.rename(columns ={col:'Silver' + col[4:]}, inplace = True)
    elif col[:2] == '03':
        df.rename(columns ={col:'Bronze' + col[4:]}, inplace = True)
    elif col[:1]=='№':
        df.rename(columns ={col:'#' + col[2:]}, inplace = True)
df.head()

,#Summer,Gold,Silver,Bronze,Total,#Winter,Gold.1,Silver.1,Bronze.1,Total.1,#Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

# Querying a DataFrame

In [29]:
won_gold = df.where(df['Gold'] > 0) #where: takes a boolean
won_gold.head()

,#Summer,Gold,Silver,Bronze,Total,#Winter,Gold.1,Silver.1,Bronze.1,Total.1,#Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Algeria (ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
Argentina (ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
Armenia (ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
Australasia (ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0

In [30]:
won_gold['Gold'].count(), df['Gold'].count()

(100, 147)

In [31]:
won_gold = won_gold.dropna()
won_gold.head()

,#Summer,Gold,Silver,Bronze,Total,#Winter,Gold.1,Silver.1,Bronze.1,Total.1,#Games,Gold.2,Silver.2,Bronze.2,Combined total
Algeria (ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
Argentina (ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
Armenia (ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
Australasia (ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0
Australia (AUS) [AUS] [Z],25.0,139.0,152.0,177.0,468.0,18.0,5.0,3.0,4.0,12.0,43.0,144.0,155.0,181.0,480.0

In [32]:
won_gold = df[df['Gold'] > 0] #without having to drop NaN
won_gold.head()

,#Summer,Gold,Silver,Bronze,Total,#Winter,Gold.1,Silver.1,Bronze.1,Total.1,#Games,Gold.2,Silver.2,Bronze.2,Combined total
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
Australia (AUS) [AUS] [Z],25,139,152,177,468,18,5,3,4,12,43,144,155,181,480

In [33]:
only_gold = df[df['Gold'] > 0]
only_gold.head()

,#Summer,Gold,Silver,Bronze,Total,#Winter,Gold.1,Silver.1,Bronze.1,Total.1,#Games,Gold.2,Silver.2,Bronze.2,Combined total
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
Australia (AUS) [AUS] [Z],25,139,152,177,468,18,5,3,4,12,43,144,155,181,480

In [34]:
len(df[(df['Gold'] > 0) | (df['Gold.1'] > 0)]) #df[(bool1) | (bool2)]

101

In [35]:
df[(df['Gold.1'] > 0) & (df['Gold'] == 0)]

,#Summer,Gold,Silver,Bronze,Total,#Winter,Gold.1,Silver.1,Bronze.1,Total.1,#Games,Gold.2,Silver.2,Bronze.2,Combined total
Liechtenstein (LIE),16,0,0,0,0,18,2,2,5,9,34,2,2,5,9

# Indexing Dataframes

In [36]:
df = won_gold
df['Country'] = df.index
df = df.set_index('Gold')
df.head()

,#Summer,Silver,Bronze,Total,#Winter,Gold.1,Silver.1,Bronze.1,Total.1,#Games,Gold.2,Silver.2,Bronze.2,Combined total,Country
Gold,,,,,,,,,,,,,,,
5,12,2,8,15,3,0,0,0,0,15,5,2,8,15,Algeria (ALG)
18,23,24,28,70,18,0,0,0,0,41,18,24,28,70,Argentina (ARG)
1,5,2,9,12,6,0,0,0,0,11,1,2,9,12,Armenia (ARM)
3,2,4,5,12,0,0,0,0,0,2,3,4,5,12,Australasia (ANZ) [ANZ]
139,25,152,177,468,18,5,3,4,12,43,144,155,181,480,Australia (AUS) [AUS] [Z]

In [37]:
df = df.reset_index() 
df.head()

,Gold,#Summer,Silver,Bronze,Total,#Winter,Gold.1,Silver.1,Bronze.1,Total.1,#Games,Gold.2,Silver.2,Bronze.2,Combined total,Country
0,5,12,2,8,15,3,0,0,0,0,15,5,2,8,15,Algeria (ALG)
1,18,23,24,28,70,18,0,0,0,0,41,18,24,28,70,Argentina (ARG)
2,1,5,2,9,12,6,0,0,0,0,11,1,2,9,12,Armenia (ARM)
3,3,2,4,5,12,0,0,0,0,0,2,3,4,5,12,Australasia (ANZ) [ANZ]
4,139,25,152,177,468,18,5,3,4,12,43,144,155,181,480,Australia (AUS) [AUS] [Z]

In [38]:
df = pd.read_csv('data\census.csv')
df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
0,40,3,6,1,0,Alabama,Alabama,4779736,4780127,4785161,...,0.002295,-0.193196,0.381066,0.582002,-0.467369,1.030015,0.826644,1.383282,1.724718,0.712594
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861

In [39]:
df['SUMLEV'].unique()

array([40, 50], dtype=int64)

In [40]:
df=df[df['SUMLEV'] == 50]
df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861
5,50,3,6,1,9,Alabama,Blount County,57322,57322,57373,...,1.807375,-1.177622,-1.748766,-2.062535,-1.369970,1.859511,-0.848580,-1.402476,-1.577232,-0.884411

In [41]:
columns_to_keep = ['STNAME',
                   'CTYNAME',
                   'BIRTHS2014',
                   'BIRTHS2015',
                   'POPESTIMATE2014',
                   'POPESTIMATE2015']
df = df[columns_to_keep]
df.head()

,STNAME,CTYNAME,BIRTHS2014,BIRTHS2015,POPESTIMATE2014,POPESTIMATE2015
1,Alabama,Autauga County,623,600,55290,55347
2,Alabama,Baldwin County,2186,2240,199713,203709
3,Alabama,Barbour County,260,269,26815,26489
4,Alabama,Bibb County,247,253,22549,22583
5,Alabama,Blount County,618,603,57658,57673

In [42]:
df = df.set_index(['STNAME', 'CTYNAME'])
df.head()

                        BIRTHS2014  BIRTHS2015  POPESTIMATE2014  \
STNAME  CTYNAME
Alabama Autauga County         623         600            55290
        Baldwin County        2186        2240           199713
        Barbour County         260         269            26815
        Bibb County            247         253            22549
        Blount County          618         603            57658

                        POPESTIMATE2015
STNAME  CTYNAME
Alabama Autauga County            55347
        Baldwin County           203709
        Barbour County            26489
        Bibb County               22583
        Blount County             57673

In [43]:
df.loc['Michigan'].tail()

                  BIRTHS2014  BIRTHS2015  POPESTIMATE2014  POPESTIMATE2015
CTYNAME
Tuscola County           538         541            53993            53777
Van Buren County         920         893            75177            75077
Washtenaw County        3683        3709           357029           358880
Wayne County           23607       23586          1766008          1759335
Wexford County           443         432            32922            33003

In [44]:
df.loc['Michigan', 'Washtenaw County']

BIRTHS2014           3683
BIRTHS2015           3709
POPESTIMATE2014    357029
POPESTIMATE2015    358880
Name: (Michigan, Washtenaw County), dtype: int64

In [45]:
df.loc[ [('Michigan', 'Washtenaw County'), ('Michigan', 'Wayne County')] ]

                           BIRTHS2014  BIRTHS2015  POPESTIMATE2014  \
STNAME   CTYNAME
Michigan Washtenaw County        3683        3709           357029
         Wayne County           23607       23586          1766008

                           POPESTIMATE2015
STNAME   CTYNAME
Michigan Washtenaw County           358880
         Wayne County              1759335

# Missing values

In [46]:
df = pd.read_csv('data\log.csv')
df.head()

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6    NaN     NaN
2  1469974544  cheryl  intro.html                  9    NaN     NaN
3  1469974574  cheryl  intro.html                 10    NaN     NaN
4  1469977514     bob  intro.html                  1    NaN     NaN

In [47]:
df = df.set_index('time')
df = df.sort_index()
df.head()

              user          video  playback position paused  volume
time
1469974424  cheryl     intro.html                  5  False    10.0
1469974424     sue  advanced.html                 23  False    10.0
1469974454  cheryl     intro.html                  6    NaN     NaN
1469974454     sue  advanced.html                 24    NaN     NaN
1469974484  cheryl     intro.html                  7    NaN     NaN

In [48]:
df = df.reset_index()
df = df.set_index(['time', 'user'])
df.head()

                           video  playback position paused  volume
time       user
1469974424 cheryl     intro.html                  5  False    10.0
           sue     advanced.html                 23  False    10.0
1469974454 cheryl     intro.html                  6    NaN     NaN
           sue     advanced.html                 24    NaN     NaN
1469974484 cheryl     intro.html                  7    NaN     NaN

In [49]:
df = df.fillna(method='ffill') #forwoard fill
df.head()

                           video  playback position  paused  volume
time       user
1469974424 cheryl     intro.html                  5   False    10.0
           sue     advanced.html                 23   False    10.0
1469974454 cheryl     intro.html                  6   False    10.0
           sue     advanced.html                 24   False    10.0
1469974484 cheryl     intro.html                  7   False    10.0